DICTIONARY = {
    'ru': {
        'saved_language_message': 'Настройка "Русский язык" сохранена',
        'main_menu_msg': 'Главное меню',
        'wanna_take_btn': '😺 Хочу взять',
        'wanna_leave_btn': '🤝 Хочу отдать',
        'lost_btn': '🆘 Потерял питомца',
        'wanna_help_btn': '💸 Хочу помочь',
        'info_btn': 'ℹ️ Полезная информация',
        'in_progress_msg': 'Данная функция в разработке. Следите за обновлениями!',
        'use_keyboard_msg': 'Воспользуйтесь пожалуйста клавиатурой.',
        'back_btn': 'Отменить и вернуться в меню 🔙',
        'ok_msg': 'Хорошо 👍',
        'yes_btn': 'Да ✅',
        'no_btn': 'Нет ❌',
        'add_ok_pet_msg': 'Животное будет добавлено в нашу базу 🐣',
        'add_no_pet_msg': 'Животное не будет добавлено 😿',
        ###
        # help
        ###
        'help_money_msg': 'Вы можете помочь нам, перечислив деньги на эту карту 💳: 5555 5555 5555 5555',
        ###
        # lost
        ###
        'lost_msg': 'Если вы потеряли животное, отправьте нам информацию о нем и мы разошлем его'''
                    'по всем доступным нам каналам связи: ',
        'ok_lost_msg': 'Не волнуйтесь, ваше сообщение принято. Мы поможем найти вашего питомца!',
        ###
        # add pet
        ###
        'add_pet_kind_msg': 'Выберите вид питомца или введите другой 🐣',
        'dog_btn': 'Собака 🐶',
        'cat_btn': 'Кот 🐱',
        'add_pet_breed_msg': 'Введите породу питомца',
        'add_pet_sex_msg': 'Выберите пол питомца 🐶 🐱',
        'male_pet_btn': 'Самец 🐶',
        'female_pet_btn': 'Самка 🐱',
        'add_pet_description_msg': 'Напишите небольшое описание о вашем животном 📝',
        'add_pet_age_msg': 'Введите возраст животного 📆',
        'add_pet_confirmation_state': 'Добавить этого питомца?',
        ###
        # take pet
        ###
        'want_take_pet_msg': 'Выберите вид питомца 🐣',
        'different_btn': 'Другие 🐰 🐤 🐥',
        'show_all_btn': 'Показать всех 🐵 🐻',
        'not_found_pet_msg': 'Питомцы не найдены 😿',
        ###
        # get_pets_info
        ###
        'sex': 'Пол: ',
        'breed': 'Порода: ',
        'age': 'Возраст: ',
        'description': 'Описание: ',
        'dog': 'Собака',
        'cat': 'Кот',
        'owner_user': 'Связаться с хозяином',

    },
    'ua': {
        'saved_language_message': 'Налаштування "Українська мова" збережено',
        'main_menu_msg': 'Головне меню',
        'wanna_take_btn': '😺 Хочу взяти',
        'wanna_leave_btn': '🤝 Хочу віддати',
        'lost_btn': '🆘 Загубив улюбленця',
        'wanna_help_btn': '💸 Хочу допомогти',
        'info_btn': 'ℹ️ Корисна інформація',
        'in_progress_msg': 'Дана функція в розробці. Слідкуйте за оновленнями!',
        'use_keyboard_msg': 'Скористайтеся будь ласка пожалуйста клавиатурою.'
    },
    'ww': {
        'choose_language_message': 'Выберите ваш язык:\n'
                                   'Оберіть вашу мову:',
        'use_buttons_warning_message': 'Воспользуйтесь клавиатурой для выбора языка\n'
                                       'Скористайтеся клавіатурою, щоб обрати мову',
        'ru_button': '🇷🇺 Русский',
        'ua_button': '🇺🇦 Українська',
    }
}
