DICTIONARY = {
    'ru': {
        'saved_language_message': 'Настройка "Русский язык" сохранена',
        'main_menu_msg': 'Главное меню',
        'wanna_take_btn': '😺 Хочу взять',
        'wanna_leave_btn': '🤝 Хочу отдать',
        'lost_btn': '🆘 Потерял питомца',
        'wanna_help_btn': '💸 Хочу помочь',
        'info_btn': 'ℹ️ Полезная информация',
        'in_progress_msg': 'Данная функция в разработке. Следите за обновлениями!',
        'use_keyboard_msg': 'Воспользуйтесь пожалуйста клавиатурой.'
    },
    'ua': {
        'saved_language_message': 'Налаштування "Українська мова" збережено',
        'main_menu_msg': 'Головне меню',
        'wanna_take_btn': '😺 Хочу взяти',
        'wanna_leave_btn': '🤝 Хочу віддати',
        'lost_btn': '🆘 Загубив улюбленця',
        'wanna_help_btn': '💸 Хочу допомогти',
        'info_btn': 'ℹ️ Корисна інформація',
        'in_progress_msg': 'Дана функція в розробці. Слідкуйте за оновленнями!',
        'use_keyboard_msg': 'Скористайтеся будь ласка пожалуйста клавиатурою.'
    },
    'ww': {
        'choose_language_message': 'Выберите ваш язык:\n'
                                   'Оберіть вашу мову:',
        'use_buttons_warning_message': 'Воспользуйтесь клавиатурой для выбора языка\n'
                                       'Скористайтеся клавіатурою, щоб обрати мову',
        'ru_button': '🇷🇺 Русский',
        'ua_button': '🇺🇦 Українська',
    }
}
