DICTIONARY = {
    'ru': {
        'saved_language_message': 'Настройка "Русский язык" сохранена',
        'main_menu_msg': 'Главное меню',
        'wanna_take_btn': '😺 Хочу взять',
        'wanna_leave_btn': '🤝 Хочу отдать',
        'lost_btn': '🆘 Потерял питомца',
        'wanna_help_btn': '💸 Хочу помочь',
        'info_btn': 'ℹ️ Полезная информация',
        'in_progress_msg': 'Данная функция в разработке. Следите за обновлениями!',
        'use_keyboard_msg': 'Воспользуйтесь пожалуйста клавиатурой.',
        'back_btn': 'Отменить и вернуться в меню 🔙',
        'ok_msg': 'Хорошо 👍',
        'yes_btn': 'Да ✅',
        'no_btn': 'Нет ❌',
        'add_ok_pet_msg': 'Животное будет добавлено в нашу базу 🐣',
        'add_no_pet_msg': 'Животное не будет добавлено 😿',
        ###
        # help
        ###
        'help_money_msg': 'Вы можете помочь нам, перечислив деньги на эту карточку 💳: 5555 5555 5555 5555',
        ###
        # lost
        ###
        'lost_msg': 'Если вы потеряли животное, отправьте нам информацию о нем и мы разошлем его'''
                    'по всем доступным нам каналам связи: ',
        'ok_lost_msg': 'Не волнуйтесь, ваше сообщение принято. Мы поможем найти вашего питомца!',
        ###
        # add pet
        ###
        'add_pet_kind_msg': 'На все описание питомца вам выделено 1024 символов, постарайтесь писать экономнее.\n'
                            'Выберите вид питомца или введите другой 🐣',
        'add_pet_name_msg': 'Введите имя питомца 🐥',
        'add_pet_no_name_btn': 'Без имени 😿',
        'dog_btn': 'Собака 🐶',
        'cat_btn': 'Кот 🐱',
        'add_pet_breed_msg': 'Введите породу питомца',
        'add_pet_sex_msg': 'Выберите пол питомца 🐶 🐱',
        'male_pet_btn': 'Самец 🐶',
        'female_pet_btn': 'Самка 🐱',
        'add_pet_description_msg': 'Напишите небольшое описание о вашем животном 📝. У вас осталось {0} символов',
        'add_pet_description_bad_msg': 'Слишком много символов ❌. Попробуйте еще раз, у вас осталось {0} символов',
        'add_pet_age_msg': 'Введите возраст животного 📆',
        'add_pet_photo_msg': 'Отправьте  фото питомца 📷',
        'photo_not_valid_msg': 'Это не фото ❌. Попробуйте еще раз.',
        'add_pet_confirmation_state': 'Добавить этого питомца?\n\n',
        ###
        # take pet
        ###
        'want_take_pet_msg': 'Выберите вид питомца 🐣',
        'different_btn': 'Другие 🐰 🐤 🐥',
        'show_all_btn': 'Показать всех 🐵 🐻',
        'not_found_pet_msg': 'Питомцы не найдены 😿',
        ###
        # get_pets_info
        ###
        'sex': 'Пол: ',
        'no_name': 'Ждет, чтобы ты его назвал',
        'name': 'Имя',
        'breed': 'Порода: ',
        'age': 'Возраст: ',
        'description': 'Описание: ',
        'dog': 'Собака',
        'cat': 'Кот',
        'owner_user': 'Связаться с хозяином',
        'print_info_msg': '{0}\n'
                          'Имя: {1}\n'
                          'Пол: {2}\n'
                          'Порода: {3}\n'
                          'Возраст: {4}\n'
                          'Описание: {5}\n'
                          '<a href="tg://user?id={6}">Связаться с хозяином</a>\n\n',
        ###
        # Inline
        ###
        'apply_btn': 'Подтвердить',
        'deny_btn': 'Отклонить',
        'urls_btn': 'Посмотреть фото {0} питомца',
        'url_btn': 'Посмотреть фото питомца',
        'applied_msg': 'Ваша заявка одобрена. Питомца теперь можно найти в поиске "Хочу взять"',
        'denied_msg': 'Ваша заявка отклонена',
    },
    'ua': {
        'saved_language_message': 'Налаштування "Українська мова" збережено',
        'main_menu_msg': 'Головне меню',
        'wanna_take_btn': '😺 Хочу взяти',
        'wanna_leave_btn': '🤝 Хочу віддати',
        'lost_btn': '🆘 Загубив улюбленця',
        'wanna_help_btn': '💸 Хочу допомогти',
        'info_btn': 'ℹ️ Корисна інформація',
        'in_progress_msg': 'Дана функція в розробці. Слідкуйте за оновленнями!',
        'use_keyboard_msg': 'Скористайтеся будь ласка клавіатурою.',
        'back_btn': 'Скасувати та повернутися в меню 🔙',
        'ok_msg': 'Добре 👍',
        'yes_btn': 'Так ✅',
        'no_btn': 'Ні ❌',
        'add_ok_pet_msg': 'Тварину буде додано до нашої бази 🐣',
        'add_no_pet_msg': 'Тварину не буде додано 😿',
        ###
        # help
        ###
        'help_money_msg': 'Ви можете допомогти нам, перерахувавши кошти на цю картку 💳: 5555 5555 5555 5555',
        ###
        # lost
        ###
        'lost_msg': 'Якщо ви втратили тварину, надішліть нам інформацію про неї та ми надішлем її'''
                    "за всіма доступними нам каналами зв'язку: ",
        'ok_lost_msg': 'Не хвилюйтеся, ваше повідомлення прийнято. Ми допоможемо знайти вашого вихованця!',
        ###
        # add pet
        ###
        'add_pet_kind_msg': 'На весь опис улюбленця у вас є 1024 символів, намагайтесь писати економніше.\n'
                            'Оберіть вид вихованця або введіть інший 🐣',
        'add_pet_name_msg': "Введіть им'я улюбленця 🐥",
        'add_pet_no_name_btn': "Ім'я поки немає 😿",
        'dog_btn': 'Пес 🐶',
        'cat_btn': 'Кіт 🐱',
        'add_pet_breed_msg': 'Введіть породу вихованця',
        'add_pet_sex_msg': 'Виберіть стать вихованця 🐶 🐱',
        'male_pet_btn': 'Самець 🐶',
        'female_pet_btn': 'Самка 🐱',
        'add_pet_description_msg': 'Напишіть короткий опис вашої тварини 📝. У вас залишилось {0} символів',
        'add_pet_description_bad_msg': 'Дуже багато символів ❌. Спробуйте ще раз, у вас залишилось {0} символів',
        'add_pet_age_msg': 'Введіть вік тварини 📆',
        'add_pet_photo_msg': 'Надішліть одне фото улюбленця 📷',
        'photo_not_valid_msg': 'Це не фото ❌. Спробуйте ще раз.',
        'add_pet_confirmation_state': 'Додати цього вихованця?\n\n',
        ###
        # take pet
        ###
        'want_take_pet_msg': 'Виберіть вид вихованця 🐣',
        'different_btn': 'Інші 🐰 🐤 🐥',
        'show_all_btn': 'Показати всіх 🐵 🐻',
        'not_found_pet_msg': 'Вихованці не знайдені 😿',
        ###
        # get_pets_info
        ###
        'sex': 'Стать: ',
        'no_name': "Чекає, щоб ти дав йому ім'я",
        'name': "Ім'я",
        'breed': 'Порода: ',
        'age': 'Вік: ',
        'description': 'Опис: ',
        'dog': 'Пес',
        'cat': 'Кіт',
        'owner_user': "Зв'язатися з власником",
        'print_info_msg': '{0}\n'
                          "Ім'я: {1}\n"
                          'Стать: {2}\n'
                          'Порода: {3}\n'
                          'Вік: {4}\n'
                          'Опис: {5}\n'
                          '<a href="tg://user?id={6}">Контакти власника</a>\n\n',
        ###
        # Inline
        ###
        'apply_btn': 'Підтвердити',
        'deny_btn': 'Відхилити',
        'urls_btn': 'Подивитись фото {0} вихованця',
        'url_btn': 'Подивитись фото вихованця',
        'applied_msg': 'Вашу заявку cхвалено. Улюбленця тепер можна знайти в пошуку "Хочу взяти"',
        'denied_msg': 'Вашу заявку відхилено',
    },
    'ww': {
        'choose_language_message': 'Выберите ваш язык:\n'
                                   'Оберіть вашу мову:',
        'use_buttons_warning_message': 'Воспользуйтесь клавиатурой для выбора языка\n'
                                       'Скористайтеся клавіатурою, щоб обрати мову',
        'ru_button': '🇷🇺 Русский',
        'ua_button': '🇺🇦 Українська',
    }
}
