DICTIONARY = {
    'ru': {
        'saved_language_message': 'Настройка "Русский язык" сохранена'
    },
    'ua': {
        'saved_language_message': 'Налаштування "Українська мова" збережено'
    },
    'ww': {
        'choose_language_message': 'Выберите ваш язык:\n'
                                   'Оберіть вашу мову:',
        'use_buttons_warning_message': 'Воспользуйтесь клавиатурой для выбора языка\n'
                                       'Скористайтеся клавіатурою, щоб обрати мову',
        'ru_button': '🇷🇺 Русский',
        'ua_button': '🇺🇦 Українська',
    }
}
